
## Terraform plan for environment: `dev`

**Commit:** 4b99876cf804b3b61c7c7bea1a6a3c94217a18a4


**API version:** 5839261e45
**CLI version:** 5839261e45
**Selfserve version:** 0519317e42
**Internal version:** release-v5.13.1
**search version:** 6dd84e6ac4

### Plan summary

`1 to add, 2 to change, 1 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0]
```
**🗑️ Deletes**

```tf
null_resource.deployed_versions
```
**📖 Reads**

```tf
module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0]
```
**🔄 Updates**

```tf
module.service.module.cloudfront.aws_cloudfront_distribution.this[0]
module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # null_resource.deployed_versions must be replaced
-/+ resource "null_resource" "deployed_versions" {
      ~ id       = "3719788716632662850" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "deployed_assets_version"      = "release-v5.13.1" -> "0519317e42"
          ~ "deployed_selfserve_image_tag" = "f14a88a7fd" -> "0519317e42"
            # (3 unchanged elements hidden)
        }
    }

  # module.service.module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E3R9S2AKJG4ZTR"
        tags                            = {}
        # (22 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "054614622558-vol-app-assets.s3.eu-west-1.amazonaws.com" -> null
          - origin_access_control_id = "E36O3W59HN75PX" -> null
          - origin_id                = "s3_oac_dev" -> null
          - origin_path              = "/release-v5.13.1" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "054614622558-vol-app-assets.s3.eu-west-1.amazonaws.com"
          + origin_access_control_id = "E36O3W59HN75PX"
          + origin_id                = "s3_oac_dev"
          + origin_path              = "/0519317e42"
        }

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["selfserve"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "vol-app-dev-selfserve-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-selfserve-cluster/vol-app-dev-selfserve-service"
        name                               = "vol-app-dev-selfserve-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-dev-selfserve-service:94" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["selfserve"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-selfserve-service:94" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-selfserve-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                      ~ {
                            name  = "APP_VERSION"
                          ~ value = "f14a88a7fd" -> "0519317e42"
                        },
                        {
                            name  = "CDN_URL"
                            value = "d23zgifomtl7hu.cloudfront.net"
                        },
                        # (2 unchanged elements hidden)
                    ]
                  ~ image                  = "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/selfserve:f14a88a7fd" -> "054614622558.dkr.ecr.eu-west-1.amazonaws.com/vol-app/selfserve:0519317e42"
                    name                   = "selfserve"
                    # (16 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "vol-app-dev-selfserve-service" -> (known after apply)
      ~ revision                 = 94 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Changes to Outputs:
  ~ deployed_assets_version      = "release-v5.13.1" -> "0519317e42"
  ~ deployed_selfserve_image_tag = "f14a88a7fd" -> "0519317e42"

```

</details>